language-tidbits/prolog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-24 Thu 18:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Computer Science 3MI3 – Prolog tidbits</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mark Armstrong" />
<meta name="description" content="Examples and code tidbits which help us understand Prolog"
 />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Computer Science 3MI3 – Prolog tidbits</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#Unguarded-cases">Unguarded cases</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7d0e5d1" class="outline-2">
<h2 id="Unguarded-cases">Unguarded cases</h2>
<div class="outline-text-2" id="text-Unguarded-cases">
<p>
Not “guarding” the cases in your predicate definitions
can result in slightly different behaviour when it comes to backtracking.
</p>
<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #a8a8a8;">% </span><span style="color: #a8a8a8;">This tidbit illustrates the effect of</span>
<span style="color: #a8a8a8;">% </span><span style="color: #a8a8a8;">not correctly restricting the application of different cases</span>
<span style="color: #a8a8a8;">% </span><span style="color: #a8a8a8;">in our predicate definitions.</span>


<span style="color: #a8a8a8;">% </span><span style="color: #a8a8a8;">This predicate is well defined; two cases,</span>
<span style="color: #a8a8a8;">% </span><span style="color: #a8a8a8;">each of which is restricted to a particular form of list.</span>
<span style="color: #feacd0;">fact1</span>(<span style="color: #b6a0ff;">[]</span>) :- writeln(<span style="color: #79a8ff;">'fact1, base case'</span>), true, <span style="color: #b6a0ff;">!</span>.
<span style="color: #feacd0;">fact1</span>(<span style="color: #b6a0ff;">[</span><span style="color: #00d3d0;">_</span><span style="color: #b6a0ff;">|</span><span style="color: #00d3d0;">T</span><span style="color: #b6a0ff;">]</span>) :- writeln(<span style="color: #79a8ff;">'fact2, recursive case'</span>),fact1(<span style="color: #00d3d0;">T</span>).



<span style="color: #a8a8a8;">% </span><span style="color: #a8a8a8;">This similar predicate includes an extra case.</span>
<span style="color: #feacd0;">fact2</span>(<span style="color: #b6a0ff;">[]</span>) :- writeln(<span style="color: #79a8ff;">'fact2, base case'</span>), true, <span style="color: #b6a0ff;">!</span>.
<span style="color: #feacd0;">fact2</span>(<span style="color: #b6a0ff;">[</span><span style="color: #00d3d0;">_</span><span style="color: #b6a0ff;">|</span><span style="color: #00d3d0;">T</span><span style="color: #b6a0ff;">]</span>) :- writeln(<span style="color: #79a8ff;">'fact2, recursive case'</span>), fact2(<span style="color: #00d3d0;">T</span>).
<span style="color: #a8a8a8;">% </span><span style="color: #a8a8a8;">The last case seems unreachable.</span>
<span style="color: #a8a8a8;">% </span><span style="color: #a8a8a8;">But this will make the search continue and return </span><span style="color: #a8a8a8;">`false`</span>
<span style="color: #a8a8a8;">% </span><span style="color: #a8a8a8;">as a second result. (Assuming the querier presses ; or &lt;space&gt;.)</span>
<span style="color: #feacd0;">fact2</span>(<span style="color: #00d3d0;">_</span>) :- writeln(<span style="color: #79a8ff;">'fact2, supposedly unreachable case'</span>), false.
</pre>
</div>

<p>
You can try out this example by loading the <a href="./src/unguarded-cases.pl">source code</a> into your REPL.
</p>
<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #a8a8a8;">% </span><span style="color: #a8a8a8;">Query test to see how Prolog will pause after the query,</span>
<span style="color: #a8a8a8;">% </span><span style="color: #a8a8a8;">allowing you to to use ; or &lt;space&gt; to then get </span><span style="color: #a8a8a8;">`false.`</span>
<span style="color: #feacd0;">test</span> :- fact2(<span style="color: #b6a0ff;">[</span>1<span style="color: #b6a0ff;">]</span>).



<span style="color: #a8a8a8;">% </span><span style="color: #a8a8a8;">Querying expected will show what we would expect to happen instead;</span>
<span style="color: #a8a8a8;">% </span><span style="color: #a8a8a8;">the search returns </span><span style="color: #a8a8a8;">`true.`</span><span style="color: #a8a8a8;"> and halts, not allowing </span><span style="color: #a8a8a8;">`;`</span><span style="color: #a8a8a8;"> or </span><span style="color: #a8a8a8;">`&lt;space&gt;`</span><span style="color: #a8a8a8;">.</span>
<span style="color: #feacd0;">expected</span> :- fact1(<span style="color: #b6a0ff;">[</span>1<span style="color: #b6a0ff;">]</span>).
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mark Armstrong</p>
     <p class="author">Contact: <a href="mailto:markparmstrong@gmail.com">markparmstrong@gmail.com</a></p>
     <p class="date">Original date: September 24th, 2020</p>
     <p class="date">Last updated: 2020-09-24 Thu 18:30</p>
     <p class="creator">Created using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.90 (<a href="https://orgmode.org">Org</a> mode 9.3.8)</p>
     <p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
